### 尹老师作为lcpandas最佳题解最多的人竟然数据库暴雷，令人感叹

In [121]:
import numpy as np
import pandas as pd

In [122]:
# 列表生成 Series
s=pd.Series([1,3,4,5,np.nan,6])
s

0    1.0
1    3.0
2    4.0
3    5.0
4    NaN
5    6.0
dtype: float64

In [123]:
# 用series 字典 对象生成DataFrame

# 创建一个DataFrame
df2 = pd.DataFrame({
    'A': 1,  # 列'A'的值全部为1
    'B': pd.Timestamp('20210609'),  # 列'B'的值为一个时间戳
    'C': pd.Series(1, index=list(range(4)), dtype='float32'),  # 列'C'的值为一个Pandas Series，索引为[0, 1, 2, 3]，值全部为1，数据类型为float32
    'D': np.array([3]*4, dtype='float32'),  # 列'D'的值为一个NumPy数组，元素全部为3，数据类型为float32
    'E': pd.Categorical(['test', 'train', 'test', 'train']),  # 列'E'的值为一个分类变量，包含四个类别'test'、'train'，数据类型为Categorical
    'F': 'SilveryZz'  # 列'F'的值全部为'foo'
})
df2

   A          B    C    D      E          F
0  1 2021-06-09  1.0  3.0   test  SilveryZz
1  1 2021-06-09  1.0  3.0  train  SilveryZz
2  1 2021-06-09  1.0  3.0   test  SilveryZz
3  1 2021-06-09  1.0  3.0  train  SilveryZz

In [124]:
#用日期
d =pd.date_range('20121213',periods=6)
d

DatetimeIndex(['2012-12-13', '2012-12-14', '2012-12-15', '2012-12-16',
               '2012-12-17', '2012-12-18'],
              dtype='datetime64[ns]', freq='D')

In [125]:
df=pd.DataFrame(np.random.rand(6,4),index=d,columns=list('ABCD'))
df#结合图细品

                   A         B         C         D
2012-12-13  0.028803  0.841311  0.784851  0.034145
2012-12-14  0.838766  0.823452  0.072605  0.810339
2012-12-15  0.691779  0.271035  0.638279  0.674137
2012-12-16  0.172504  0.754690  0.069969  0.586417
2012-12-17  0.684312  0.366834  0.842559  0.484955
2012-12-18  0.834006  0.499190  0.695847  0.205215

In [126]:
df2.dtypes

A             int64
B    datetime64[ns]
C           float32
D           float32
E          category
F            object
dtype: object

In [127]:
df2.head()

   A          B    C    D      E          F
0  1 2021-06-09  1.0  3.0   test  SilveryZz
1  1 2021-06-09  1.0  3.0  train  SilveryZz
2  1 2021-06-09  1.0  3.0   test  SilveryZz
3  1 2021-06-09  1.0  3.0  train  SilveryZz

In [128]:
df2.tail(3)

   A          B    C    D      E          F
1  1 2021-06-09  1.0  3.0  train  SilveryZz
2  1 2021-06-09  1.0  3.0   test  SilveryZz
3  1 2021-06-09  1.0  3.0  train  SilveryZz

In [129]:
df2.index

Int64Index([0, 1, 2, 3], dtype='int64')

In [130]:
df2.columns

Index(['A', 'B', 'C', 'D', 'E', 'F'], dtype='object')

In [131]:
df.describe()

              A         B         C         D
count  6.000000  6.000000  6.000000  6.000000
mean   0.541695  0.592752  0.517352  0.465868
std    0.350976  0.246789  0.352633  0.293686
min    0.028803  0.271035  0.069969  0.034145
25%    0.300456  0.399923  0.214023  0.275150
50%    0.688045  0.626940  0.667063  0.535686
75%    0.798450  0.806262  0.762600  0.652207
max    0.838766  0.841311  0.842559  0.810339

In [132]:
df.sort_index(axis=1,ascending=False)#ascending就是升序

                   D         C         B         A
2012-12-13  0.034145  0.784851  0.841311  0.028803
2012-12-14  0.810339  0.072605  0.823452  0.838766
2012-12-15  0.674137  0.638279  0.271035  0.691779
2012-12-16  0.586417  0.069969  0.754690  0.172504
2012-12-17  0.484955  0.842559  0.366834  0.684312
2012-12-18  0.205215  0.695847  0.499190  0.834006

In [133]:
df.sort_values(by='B')

                   A         B         C         D
2012-12-15  0.691779  0.271035  0.638279  0.674137
2012-12-17  0.684312  0.366834  0.842559  0.484955
2012-12-18  0.834006  0.499190  0.695847  0.205215
2012-12-16  0.172504  0.754690  0.069969  0.586417
2012-12-14  0.838766  0.823452  0.072605  0.810339
2012-12-13  0.028803  0.841311  0.784851  0.034145

### 选择数据

In [134]:
print(df)
print(df['A'])

                   A         B         C         D
2012-12-13  0.028803  0.841311  0.784851  0.034145
2012-12-14  0.838766  0.823452  0.072605  0.810339
2012-12-15  0.691779  0.271035  0.638279  0.674137
2012-12-16  0.172504  0.754690  0.069969  0.586417
2012-12-17  0.684312  0.366834  0.842559  0.484955
2012-12-18  0.834006  0.499190  0.695847  0.205215
2012-12-13    0.028803
2012-12-14    0.838766
2012-12-15    0.691779
2012-12-16    0.172504
2012-12-17    0.684312
2012-12-18    0.834006
Freq: D, Name: A, dtype: float64

In [135]:
print(df)
print(df[1:3])

                   A         B         C         D
2012-12-13  0.028803  0.841311  0.784851  0.034145
2012-12-14  0.838766  0.823452  0.072605  0.810339
2012-12-15  0.691779  0.271035  0.638279  0.674137
2012-12-16  0.172504  0.754690  0.069969  0.586417
2012-12-17  0.684312  0.366834  0.842559  0.484955
2012-12-18  0.834006  0.499190  0.695847  0.205215
                   A         B         C         D
2012-12-14  0.838766  0.823452  0.072605  0.810339
2012-12-15  0.691779  0.271035  0.638279  0.674137

In [136]:
# 也可以标签索引
print(df)
print(df['2012-12-13':'2012-12-17'])

                   A         B         C         D
2012-12-13  0.028803  0.841311  0.784851  0.034145
2012-12-14  0.838766  0.823452  0.072605  0.810339
2012-12-15  0.691779  0.271035  0.638279  0.674137
2012-12-16  0.172504  0.754690  0.069969  0.586417
2012-12-17  0.684312  0.366834  0.842559  0.484955
2012-12-18  0.834006  0.499190  0.695847  0.205215
                   A         B         C         D
2012-12-13  0.028803  0.841311  0.784851  0.034145
2012-12-14  0.838766  0.823452  0.072605  0.810339
2012-12-15  0.691779  0.271035  0.638279  0.674137
2012-12-16  0.172504  0.754690  0.069969  0.586417
2012-12-17  0.684312  0.366834  0.842559  0.484955

In [137]:
#按标签一行
df.loc['2012-12-13']

A    0.028803
B    0.841311
C    0.784851
D    0.034145
Name: 2012-12-13 00:00:00, dtype: float64

In [138]:
df.loc[d[0]]

A    0.028803
B    0.841311
C    0.784851
D    0.034145
Name: 2012-12-13 00:00:00, dtype: float64

In [139]:
df.loc[:,['A','B']]

                   A         B
2012-12-13  0.028803  0.841311
2012-12-14  0.838766  0.823452
2012-12-15  0.691779  0.271035
2012-12-16  0.172504  0.754690
2012-12-17  0.684312  0.366834
2012-12-18  0.834006  0.499190

In [140]:
df.loc['2012-12-13':'2012-12-16',['A','B']]

                   A         B
2012-12-13  0.028803  0.841311
2012-12-14  0.838766  0.823452
2012-12-15  0.691779  0.271035
2012-12-16  0.172504  0.754690

In [141]:
df.loc['2012-12-14','A']
df.at['2012-12-14','A']#faster

0.838765782522617

In [142]:
#按位置行
df.iloc[0]#df.loc[d[0]]

A    0.028803
B    0.841311
C    0.784851
D    0.034145
Name: 2012-12-13 00:00:00, dtype: float64

In [143]:
#整数切片
df.iloc[3:5,0:2]#先行后列

                   A         B
2012-12-16  0.172504  0.754690
2012-12-17  0.684312  0.366834

In [144]:
df.iloc[1:3,:]

                   A         B         C         D
2012-12-14  0.838766  0.823452  0.072605  0.810339
2012-12-15  0.691779  0.271035  0.638279  0.674137

In [145]:
df.iloc[:,1:3]

                   B         C
2012-12-13  0.841311  0.784851
2012-12-14  0.823452  0.072605
2012-12-15  0.271035  0.638279
2012-12-16  0.754690  0.069969
2012-12-17  0.366834  0.842559
2012-12-18  0.499190  0.695847

In [146]:
#显式拾取
df.iloc[1,1]
df.iat[1,1]#更快

0.8234524033412023

In [147]:
df[df['B']>0.4]

                   A         B         C         D
2012-12-13  0.028803  0.841311  0.784851  0.034145
2012-12-14  0.838766  0.823452  0.072605  0.810339
2012-12-16  0.172504  0.754690  0.069969  0.586417
2012-12-18  0.834006  0.499190  0.695847  0.205215

In [148]:
df[df>0.4]

                   A         B         C         D
2012-12-13       NaN  0.841311  0.784851       NaN
2012-12-14  0.838766  0.823452       NaN  0.810339
2012-12-15  0.691779       NaN  0.638279  0.674137
2012-12-16       NaN  0.754690       NaN  0.586417
2012-12-17  0.684312       NaN  0.842559  0.484955
2012-12-18  0.834006  0.499190  0.695847       NaN

In [149]:
df3=df.copy()
df3['E']=['a','b','c','d','e','f']
df3

                   A         B         C         D  E
2012-12-13  0.028803  0.841311  0.784851  0.034145  a
2012-12-14  0.838766  0.823452  0.072605  0.810339  b
2012-12-15  0.691779  0.271035  0.638279  0.674137  c
2012-12-16  0.172504  0.754690  0.069969  0.586417  d
2012-12-17  0.684312  0.366834  0.842559  0.484955  e
2012-12-18  0.834006  0.499190  0.695847  0.205215  f

In [150]:
df3[df3['E'].isin(['c','d'])]

                   A         B         C         D  E
2012-12-15  0.691779  0.271035  0.638279  0.674137  c
2012-12-16  0.172504  0.754690  0.069969  0.586417  d

### 赋值

In [151]:
s1=pd.Series([1,2,3,4,5,6],index=d)#dd上面声明了就是日期那一列
s1

2012-12-13    1
2012-12-14    2
2012-12-15    3
2012-12-16    4
2012-12-17    5
2012-12-18    6
Freq: D, dtype: int64

In [152]:
df['F']=s1
df

                   A         B         C         D  F
2012-12-13  0.028803  0.841311  0.784851  0.034145  1
2012-12-14  0.838766  0.823452  0.072605  0.810339  2
2012-12-15  0.691779  0.271035  0.638279  0.674137  3
2012-12-16  0.172504  0.754690  0.069969  0.586417  4
2012-12-17  0.684312  0.366834  0.842559  0.484955  5
2012-12-18  0.834006  0.499190  0.695847  0.205215  6

In [153]:
df.at['2012-12-13','A']=0
df

                   A         B         C         D  F
2012-12-13  0.000000  0.841311  0.784851  0.034145  1
2012-12-14  0.838766  0.823452  0.072605  0.810339  2
2012-12-15  0.691779  0.271035  0.638279  0.674137  3
2012-12-16  0.172504  0.754690  0.069969  0.586417  4
2012-12-17  0.684312  0.366834  0.842559  0.484955  5
2012-12-18  0.834006  0.499190  0.695847  0.205215  6

In [154]:
df.iat[0,2]=0
df

                   A         B         C         D  F
2012-12-13  0.000000  0.841311  0.000000  0.034145  1
2012-12-14  0.838766  0.823452  0.072605  0.810339  2
2012-12-15  0.691779  0.271035  0.638279  0.674137  3
2012-12-16  0.172504  0.754690  0.069969  0.586417  4
2012-12-17  0.684312  0.366834  0.842559  0.484955  5
2012-12-18  0.834006  0.499190  0.695847  0.205215  6

In [155]:
df['G']=[1,2,3,4,5,6]
df

                   A         B         C         D  F  G
2012-12-13  0.000000  0.841311  0.000000  0.034145  1  1
2012-12-14  0.838766  0.823452  0.072605  0.810339  2  2
2012-12-15  0.691779  0.271035  0.638279  0.674137  3  3
2012-12-16  0.172504  0.754690  0.069969  0.586417  4  4
2012-12-17  0.684312  0.366834  0.842559  0.484955  5  5
2012-12-18  0.834006  0.499190  0.695847  0.205215  6  6

In [156]:
df.loc[:,'D']=np.ones_like(df['D'])
df

                   A         B         C    D  F  G
2012-12-13  0.000000  0.841311  0.000000  1.0  1  1
2012-12-14  0.838766  0.823452  0.072605  1.0  2  2
2012-12-15  0.691779  0.271035  0.638279  1.0  3  3
2012-12-16  0.172504  0.754690  0.069969  1.0  4  4
2012-12-17  0.684312  0.366834  0.842559  1.0  5  5
2012-12-18  0.834006  0.499190  0.695847  1.0  6  6

In [163]:
df3=df.copy()
df3[df3<0.4]=0
df3

                   A         B         C    D  F  G
2012-12-13  0.000000  0.841311  0.000000  1.0  1  1
2012-12-14  0.838766  0.823452  0.000000  1.0  2  2
2012-12-15  0.691779  0.000000  0.638279  1.0  3  3
2012-12-16  0.000000  0.754690  0.000000  1.0  4  4
2012-12-17  0.684312  0.000000  0.842559  1.0  5  5
2012-12-18  0.834006  0.499190  0.695847  1.0  6  6

In [170]:
df1=df.reindex(index=d[0:4],columns=list(df.columns)+['E'])
df1.loc[d[0]:d[1],'E']=1
df1

                   A         B         C    D  F  G    E
2012-12-13  0.000000  0.841311  0.000000  1.0  1  1  1.0
2012-12-14  0.838766  0.823452  0.072605  1.0  2  2  1.0
2012-12-15  0.691779  0.271035  0.638279  1.0  3  3  NaN
2012-12-16  0.172504  0.754690  0.069969  1.0  4  4  NaN

In [174]:
df1.dropna(how='any')#不会改变原来的行数   df1=

                   A         B         C    D  F  G    E
2012-12-13  0.000000  0.841311  0.000000  1.0  1  1  1.0
2012-12-14  0.838766  0.823452  0.072605  1.0  2  2  1.0

In [178]:
df1.fillna(value=5)#将NaN变成value 同上不会改变原来的除df1=

                   A         B         C    D  F  G    E
2012-12-13  0.000000  0.841311  0.000000  1.0  1  1  1.0
2012-12-14  0.838766  0.823452  0.072605  1.0  2  2  1.0
2012-12-15  0.691779  0.271035  0.638279  1.0  3  3  5.0
2012-12-16  0.172504  0.754690  0.069969  1.0  4  4  5.0

In [179]:
pd.isna(df1)#或df1.isna

                A      B      C      D      F      G      E
2012-12-13  False  False  False  False  False  False  False
2012-12-14  False  False  False  False  False  False  False
2012-12-15  False  False  False  False  False  False   True
2012-12-16  False  False  False  False  False  False   True

### 运算

In [184]:
df1 = pd.DataFrame(np.random.randn(2,5))
df1

          0         1         2         3         4
0 -1.086883 -0.757174 -0.326363 -0.509067 -0.340037
1 -0.452835  0.484629  1.199787  1.167277 -1.520560

In [186]:
df2= pd.DataFrame(np.random.randn(3,4))
df2

          0         1         2         3
0  1.718145  0.499841  0.847984  0.153660
1 -0.052433  1.285062  0.697688 -1.178054
2  0.272840  0.129797 -0.021735  0.093578

In [189]:
print("1+2\n",df1+df2,end="\n\n")#NaN运算后还是NaN，每个值的算术
print("1-2\n",df1-df2,end="\n\n")
print("1*2\n",df1*df2,end="\n\n")
print("1/2\n",df1/df2,end="\n\n")

1+2
           0         1         2         3   4
0  0.631263 -0.257333  0.521621 -0.355407 NaN
1 -0.505268  1.769691  1.897474 -0.010778 NaN
2       NaN       NaN       NaN       NaN NaN

1-2
           0         1         2         3   4
0 -2.805028 -1.257015 -1.174347 -0.662727 NaN
1 -0.400401 -0.800432  0.502099  2.345331 NaN
2       NaN       NaN       NaN       NaN NaN

1*2
           0         1         2         3   4
0 -1.867422 -0.378467 -0.276751 -0.078223 NaN
1  0.023744  0.622779  0.837077 -1.375115 NaN
2       NaN       NaN       NaN       NaN NaN

1/2
           0         1         2         3   4
0 -0.632591 -1.514830 -0.384870 -3.312946 NaN
1  8.636364  0.377125  1.719661 -0.990851 NaN
2       NaN       NaN       NaN       NaN NaN

| 方法 | 英文全称 | 用途 |
| --- | --- | --- |
| eq | equal to | 等于 |
| ne | not equal to | 不等于 |
| lt | less than | 小于 |
| gt | greater than | 大于 |
| le | less than or equal to | 小于等于 |
| ge | greater than or equal to | 大于等于 |

**返回一个尺寸大的df**

1. 
```
    df.describe()：查看数据值列的汇总统计
    df.mean()：返回所有列的均值
    df.corr()：返回列与列之间的相关系数
    df.count()：返回每一列中的非空值的个数
    df.max()：返回每一列的最大值
    df.min()：返回每一列的最小值
    df.median()：返回每一列的中位数
    df.std()：返回每一列的标准差
```
2.  `d1.count() #非空元素计算`
3.  `d1.min() #最小值`
4.  `d1.max() #最大值`
5.  `d1.idxmin() #最小值的位置，类似于R中的which.min函数`
6.  `d1.idxmax() #最大值的位置，类似于R中的which.max函数`
7.  `d1.quantile(0.1) #10%分位数`
8.  `d1.sum() #求和`
9.  `d1.mean() #均值`
10.  `d1.median() #中位数`
11.  `d1.mode() #众数`
12.  `d1.var() #方差`
13.  `d1.std() #标准差`
14.  `d1.mad() #平均绝对偏差`
15.  `d1.skew() #偏度`
16.  `d1.kurt() #峰度`
17.  `d1.describe() #一次性输出多个描述性统计指标`

必须注意的是，descirbe方法只能针对序列或数据框，一维数组是没有这个方法的

这里自定义一个函数，将这些统计描述指标全部汇总到一起:

1.  `def stats(x):`
2.  `return pd.Series([x.count(),x.min(),x.idxmin(),`
3.  `x.quantile(.25),x.median(),`
4.  `x.quantile(.75),x.mean(),`
5.  `x.max(),x.idxmax(),`
6.  `x.mad(),x.var(),`
7.  `x.std(),x.skew(),x.kurt()],`
8.  `index = ['Count','Min','Whicn_Min',`
9.  `'Q1','Median','Q3','Mean',`
10.  `'Max','Which_Max','Mad',`
11.  `'Var','Std','Skew','Kurt'])`
12.  `stats(d1)`

在实际的工作中，我们可能需要处理的是一系列的数值型数据框，如何将这个函数应用到数据框中的每一列呢？可以使用apply函数，这个非常类似于R中的apply的应用方法。  
将之前创建的d1,d2,d3数据构建数据框:

1.  `df = pd.DataFrame(np.array([d1,d2,d3]).T,columns=['x1','x2','x3'])`
2.  `df.head()`
3.  `df.apply(stats)`

非常完美，就这样很简单的创建了数值型数据的统计性描述。如果是离散型数据呢？就不能用这个统计口径了，我们需要统计离散变量的观测数、唯一值个数、众数水平及个数。你只需要使用describe方法就可以实现这样的统计了。

1.  `student['Sex'].describe()`

除以上的简单描述性统计之外，还提供了连续变量的相关系数（corr）和协方差矩阵（cov）的求解，这个跟R语言是一致的用法。

1.  `df.corr()`

关于相关系数的计算可以调用pearson方法或kendell方法或spearman方法，默认使用pearson方法。

1.  `df.corr('spearman')`

如果只想关注某一个变量与其余变量的相关系数的话，可以使用corrwith,如下方只关心x1与其余变量的相关系数:

1.  `df.corrwith(df['x1'])`

数值型变量间的协方差矩阵

1.  `` `df.cov()` ``

In [190]:
#合并==拼一块
pd.concat([df1,df2])

          0         1         2         3         4
0 -1.086883 -0.757174 -0.326363 -0.509067 -0.340037
1 -0.452835  0.484629  1.199787  1.167277 -1.520560
0  1.718145  0.499841  0.847984  0.153660       NaN
1 -0.052433  1.285062  0.697688 -1.178054       NaN
2  0.272840  0.129797 -0.021735  0.093578       NaN

```
merge的用法
pd.merge(DataFrame1,DataFrame2,how="inner",on=None,left_on=None,right_on=None, left_index=False, right_index=False, sort=False, suffixes=(’_x’, ‘_y’))


how:默认为inner，可设为inner/outer/left/right

on：用于链接的列名，该列名必须存在于两个dataframe对象中。若未指明。则以两个表的交集作为链接键。

left_on:左侧DataFrame中用作链接键的列。

right_on:右侧DataFrame中用作链接键的列。

right_index:右侧的行索引作为键连接

left_index:左侧的行索引作为键连接

sort:根据连接键对合并后的数据进行排列，默认为True

suffixes：对两个数据集中出现的重复列，新数据集中加上后缀_x,_y进行区别
```

In [191]:
df1 = pd.DataFrame({"key":list("bbaca"),"data1":range(5)})
df2 = pd.DataFrame({"key":["a","b","d"],"data2":range(3)})

In [192]:
df1

  key  data1
0   b      0
1   b      1
2   a      2
3   c      3
4   a      4

In [193]:
df2

  key  data2
0   a      0
1   b      1
2   d      2

In [194]:
pd.merge(df1,df2,on='key')

  key  data1  data2
0   b      0      1
1   b      1      1
2   a      2      0
3   a      4      0